{"title": "QFT-LQG Coupling Constant Determination", "description": "The coupling between quantum field theory and loop quantum gravity lacks rigorous derivation from first principles. Current phenomenological approach introduces theoretical uncertainty.", "type": "theoretical", "severity": 80, "category": "fundamental_physics", "impact": "Core coupling affects all QFT predictions in curved quantum spacetime"}
{"title": "Vacuum State Definition in Quantum Geometry", "description": "The definition of vacuum states in discrete quantum geometry is ambiguous. Different choices lead to different particle creation predictions.", "type": "theoretical", "severity": 70, "category": "quantum_foundations", "impact": "Affects all particle physics predictions and energy enhancement calculations"}
{"title": "Renormalization Scheme Dependence", "description": "QFT calculations show dependence on renormalization scheme choice when combined with LQG discreteness. Need scheme-independent formulation.", "type": "theoretical", "severity": 65, "category": "mathematical_consistency", "impact": "Results may not be physically meaningful if scheme-dependent"}
{"title": "High-Energy Behavior Validation", "description": "QFT behavior at energy scales approaching Planck scale lacks experimental validation and theoretical control.", "type": "validation", "severity": 75, "category": "regime_validity", "impact": "Predictions at high energies may be completely unreliable"}
{"title": "Lorentz Invariance in Discrete Spacetime", "description": "Discrete LQG geometry may break Lorentz invariance at fundamental level. Need systematic analysis of remnant symmetries.", "type": "theoretical", "severity": 85, "category": "symmetry_breaking", "impact": "Could violate fundamental physics principles and experimental observations"}
{"title": "Field Regularization on Spin Networks", "description": "Regularization of quantum fields on discrete spin networks is not unique. Different regularizations give different physical predictions.", "type": "theoretical", "severity": 60, "category": "regularization_ambiguity", "impact": "Introduces systematic uncertainties in all field calculations"}
{"title": "Computational Complexity Scaling", "description": "QFT calculations on large spin networks scale exponentially with system size, limiting practical applications.", "type": "in silico", "severity": 55, "category": "computational_limitations", "impact": "Restricts calculations to small systems, limiting physical relevance"}
